name: "DenseNet-121_train"
layer {
  name: "data"
  type: "Data"
  top: "data"
  top: "label"
  transform_param {
    scale: 0.0078125
    mirror: true
    mean_value: 127.5
    mean_value: 127.5
    mean_value: 127.5
  }
  data_param {
    source: "/data/train_lmdb"
    batch_size: 8
    backend: LMDB
  }
}
layer {
  name: "conv_1"
  type: "Convolution"
  bottom: "data"
  top: "conv_1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 3
    kernel_size: 7
    stride: 2
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "relu_1"
  type: "PReLU"
  bottom: "conv_1"
  top: "conv_1"
}
layer {
  name: "pool_1"
  type: "Pooling"
  bottom: "conv_1"
  top: "pool_1"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "block_1_1_1x1_bn"
  type: "BatchNorm"
  bottom: "pool_1"
  top: "block_1_1_1x1_bn"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "block_1_1_1x1_scale"
  type: "Scale"
  bottom: "block_1_1_1x1_bn"
  top: "block_1_1_1x1_bn"
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "block_1_1_1x1_relu"
  type: "PReLU"
  bottom: "block_1_1_1x1_bn"
  top: "block_1_1_1x1_bn"
}
layer {
  name: "block_1_1_1x1_conv"
  type: "Convolution"
  bottom: "block_1_1_1x1_bn"
  top: "block_1_1_1x1_conv"
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "block_1_1_1x1_dropout"
  type: "Dropout"
  bottom: "block_1_1_1x1_conv"
  top: "block_1_1_1x1_dropout"
  dropout_param {
    dropout_ratio: 0.2
  }
}
layer {
  name: "block_1_1_3x3_bn"
  type: "BatchNorm"
  bottom: "block_1_1_1x1_dropout"
  top: "block_1_1_3x3_bn"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "block_1_1_3x3_scale"
  type: "Scale"
  bottom: "block_1_1_3x3_bn"
  top: "block_1_1_3x3_bn"
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "block_1_1_3x3_relu"
  type: "PReLU"
  bottom: "block_1_1_3x3_bn"
  top: "block_1_1_3x3_bn"
}
layer {
  name: "block_1_1_3x3_conv"
  type: "Convolution"
  bottom: "block_1_1_3x3_bn"
  top: "block_1_1_3x3_conv"
  convolution_param {
    num_output: 32
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "block_1_1_3x3_dropout"
  type: "Dropout"
  bottom: "block_1_1_3x3_conv"
  top: "block_1_1_3x3_dropout"
  dropout_param {
    dropout_ratio: 0.2
  }
}
layer {
  name: "block_1_1_concat"
  type: "Concat"
  bottom: "pool_1"
  bottom: "block_1_1_3x3_dropout"
  top: "block_1_1_concat"
  concat_param {
    axis: 1
  }
}
layer {
  name: "block_1_2_1x1_bn"
  type: "BatchNorm"
  bottom: "block_1_1_concat"
  top: "block_1_2_1x1_bn"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "block_1_2_1x1_scale"
  type: "Scale"
  bottom: "block_1_2_1x1_bn"
  top: "block_1_2_1x1_bn"
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "block_1_2_1x1_relu"
  type: "PReLU"
  bottom: "block_1_2_1x1_bn"
  top: "block_1_2_1x1_bn"
}
layer {
  name: "block_1_2_1x1_conv"
  type: "Convolution"
  bottom: "block_1_2_1x1_bn"
  top: "block_1_2_1x1_conv"
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "block_1_2_1x1_dropout"
  type: "Dropout"
  bottom: "block_1_2_1x1_conv"
  top: "block_1_2_1x1_dropout"
  dropout_param {
    dropout_ratio: 0.2
  }
}
layer {
  name: "block_1_2_3x3_bn"
  type: "BatchNorm"
  bottom: "block_1_2_1x1_dropout"
  top: "block_1_2_3x3_bn"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "block_1_2_3x3_scale"
  type: "Scale"
  bottom: "block_1_2_3x3_bn"
  top: "block_1_2_3x3_bn"
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "block_1_2_3x3_relu"
  type: "PReLU"
  bottom: "block_1_2_3x3_bn"
  top: "block_1_2_3x3_bn"
}
layer {
  name: "block_1_2_3x3_conv"
  type: "Convolution"
  bottom: "block_1_2_3x3_bn"
  top: "block_1_2_3x3_conv"
  convolution_param {
    num_output: 32
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "block_1_2_3x3_dropout"
  type: "Dropout"
  bottom: "block_1_2_3x3_conv"
  top: "block_1_2_3x3_dropout"
  dropout_param {
    dropout_ratio: 0.2
  }
}
layer {
  name: "block_1_2_concat"
  type: "Concat"
  bottom: "block_1_1_concat"
  bottom: "block_1_2_3x3_dropout"
  top: "block_1_2_concat"
  concat_param {
    axis: 1
  }
}
layer {
  name: "block_1_3_1x1_bn"
  type: "BatchNorm"
  bottom: "block_1_2_concat"
  top: "block_1_3_1x1_bn"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "block_1_3_1x1_scale"
  type: "Scale"
  bottom: "block_1_3_1x1_bn"
  top: "block_1_3_1x1_bn"
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "block_1_3_1x1_relu"
  type: "PReLU"
  bottom: "block_1_3_1x1_bn"
  top: "block_1_3_1x1_bn"
}
layer {
  name: "block_1_3_1x1_conv"
  type: "Convolution"
  bottom: "block_1_3_1x1_bn"
  top: "block_1_3_1x1_conv"
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "block_1_3_1x1_dropout"
  type: "Dropout"
  bottom: "block_1_3_1x1_conv"
  top: "block_1_3_1x1_dropout"
  dropout_param {
    dropout_ratio: 0.2
  }
}
layer {
  name: "block_1_3_3x3_bn"
  type: "BatchNorm"
  bottom: "block_1_3_1x1_dropout"
  top: "block_1_3_3x3_bn"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "block_1_3_3x3_scale"
  type: "Scale"
  bottom: "block_1_3_3x3_bn"
  top: "block_1_3_3x3_bn"
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "block_1_3_3x3_relu"
  type: "PReLU"
  bottom: "block_1_3_3x3_bn"
  top: "block_1_3_3x3_bn"
}
layer {
  name: "block_1_3_3x3_conv"
  type: "Convolution"
  bottom: "block_1_3_3x3_bn"
  top: "block_1_3_3x3_conv"
  convolution_param {
    num_output: 32
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "block_1_3_3x3_dropout"
  type: "Dropout"
  bottom: "block_1_3_3x3_conv"
  top: "block_1_3_3x3_dropout"
  dropout_param {
    dropout_ratio: 0.2
  }
}
layer {
  name: "block_1_3_concat"
  type: "Concat"
  bottom: "block_1_2_concat"
  bottom: "block_1_3_3x3_dropout"
  top: "block_1_3_concat"
  concat_param {
    axis: 1
  }
}
layer {
  name: "block_1_4_1x1_bn"
  type: "BatchNorm"
  bottom: "block_1_3_concat"
  top: "block_1_4_1x1_bn"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "block_1_4_1x1_scale"
  type: "Scale"
  bottom: "block_1_4_1x1_bn"
  top: "block_1_4_1x1_bn"
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "block_1_4_1x1_relu"
  type: "PReLU"
  bottom: "block_1_4_1x1_bn"
  top: "block_1_4_1x1_bn"
}
layer {
  name: "block_1_4_1x1_conv"
  type: "Convolution"
  bottom: "block_1_4_1x1_bn"
  top: "block_1_4_1x1_conv"
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "block_1_4_1x1_dropout"
  type: "Dropout"
  bottom: "block_1_4_1x1_conv"
  top: "block_1_4_1x1_dropout"
  dropout_param {
    dropout_ratio: 0.2
  }
}
layer {
  name: "block_1_4_3x3_bn"
  type: "BatchNorm"
  bottom: "block_1_4_1x1_dropout"
  top: "block_1_4_3x3_bn"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "block_1_4_3x3_scale"
  type: "Scale"
  bottom: "block_1_4_3x3_bn"
  top: "block_1_4_3x3_bn"
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "block_1_4_3x3_relu"
  type: "PReLU"
  bottom: "block_1_4_3x3_bn"
  top: "block_1_4_3x3_bn"
}
layer {
  name: "block_1_4_3x3_conv"
  type: "Convolution"
  bottom: "block_1_4_3x3_bn"
  top: "block_1_4_3x3_conv"
  convolution_param {
    num_output: 32
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "block_1_4_3x3_dropout"
  type: "Dropout"
  bottom: "block_1_4_3x3_conv"
  top: "block_1_4_3x3_dropout"
  dropout_param {
    dropout_ratio: 0.2
  }
}
layer {
  name: "block_1_4_concat"
  type: "Concat"
  bottom: "block_1_3_concat"
  bottom: "block_1_4_3x3_dropout"
  top: "block_1_4_concat"
  concat_param {
    axis: 1
  }
}
layer {
  name: "block_1_5_1x1_bn"
  type: "BatchNorm"
  bottom: "block_1_4_concat"
  top: "block_1_5_1x1_bn"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "block_1_5_1x1_scale"
  type: "Scale"
  bottom: "block_1_5_1x1_bn"
  top: "block_1_5_1x1_bn"
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "block_1_5_1x1_relu"
  type: "PReLU"
  bottom: "block_1_5_1x1_bn"
  top: "block_1_5_1x1_bn"
}
layer {
  name: "block_1_5_1x1_conv"
  type: "Convolution"
  bottom: "block_1_5_1x1_bn"
  top: "block_1_5_1x1_conv"
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "block_1_5_1x1_dropout"
  type: "Dropout"
  bottom: "block_1_5_1x1_conv"
  top: "block_1_5_1x1_dropout"
  dropout_param {
    dropout_ratio: 0.2
  }
}
layer {
  name: "block_1_5_3x3_bn"
  type: "BatchNorm"
  bottom: "block_1_5_1x1_dropout"
  top: "block_1_5_3x3_bn"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "block_1_5_3x3_scale"
  type: "Scale"
  bottom: "block_1_5_3x3_bn"
  top: "block_1_5_3x3_bn"
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "block_1_5_3x3_relu"
  type: "PReLU"
  bottom: "block_1_5_3x3_bn"
  top: "block_1_5_3x3_bn"
}
layer {
  name: "block_1_5_3x3_conv"
  type: "Convolution"
  bottom: "block_1_5_3x3_bn"
  top: "block_1_5_3x3_conv"
  convolution_param {
    num_output: 32
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "block_1_5_3x3_dropout"
  type: "Dropout"
  bottom: "block_1_5_3x3_conv"
  top: "block_1_5_3x3_dropout"
  dropout_param {
    dropout_ratio: 0.2
  }
}
layer {
  name: "block_1_5_concat"
  type: "Concat"
  bottom: "block_1_4_concat"
  bottom: "block_1_5_3x3_dropout"
  top: "block_1_5_concat"
  concat_param {
    axis: 1
  }
}
layer {
  name: "block_1_6_1x1_bn"
  type: "BatchNorm"
  bottom: "block_1_5_concat"
  top: "block_1_6_1x1_bn"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "block_1_6_1x1_scale"
  type: "Scale"
  bottom: "block_1_6_1x1_bn"
  top: "block_1_6_1x1_bn"
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "block_1_6_1x1_relu"
  type: "PReLU"
  bottom: "block_1_6_1x1_bn"
  top: "block_1_6_1x1_bn"
}
layer {
  name: "block_1_6_1x1_conv"
  type: "Convolution"
  bottom: "block_1_6_1x1_bn"
  top: "block_1_6_1x1_conv"
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "block_1_6_1x1_dropout"
  type: "Dropout"
  bottom: "block_1_6_1x1_conv"
  top: "block_1_6_1x1_dropout"
  dropout_param {
    dropout_ratio: 0.2
  }
}
layer {
  name: "block_1_6_3x3_bn"
  type: "BatchNorm"
  bottom: "block_1_6_1x1_dropout"
  top: "block_1_6_3x3_bn"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "block_1_6_3x3_scale"
  type: "Scale"
  bottom: "block_1_6_3x3_bn"
  top: "block_1_6_3x3_bn"
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "block_1_6_3x3_relu"
  type: "PReLU"
  bottom: "block_1_6_3x3_bn"
  top: "block_1_6_3x3_bn"
}
layer {
  name: "block_1_6_3x3_conv"
  type: "Convolution"
  bottom: "block_1_6_3x3_bn"
  top: "block_1_6_3x3_conv"
  convolution_param {
    num_output: 32
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "block_1_6_3x3_dropout"
  type: "Dropout"
  bottom: "block_1_6_3x3_conv"
  top: "block_1_6_3x3_dropout"
  dropout_param {
    dropout_ratio: 0.2
  }
}
layer {
  name: "block_1_6_concat"
  type: "Concat"
  bottom: "block_1_5_concat"
  bottom: "block_1_6_3x3_dropout"
  top: "block_1_6_concat"
  concat_param {
    axis: 1
  }
}
layer {
  name: "transition_down_1_1x1_bn"
  type: "BatchNorm"
  bottom: "block_1_6_concat"
  top: "transition_down_1_1x1_bn"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "transition_down_1_1x1_scale"
  type: "Scale"
  bottom: "transition_down_1_1x1_bn"
  top: "transition_down_1_1x1_bn"
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "transition_down_1_1x1_relu"
  type: "PReLU"
  bottom: "transition_down_1_1x1_bn"
  top: "transition_down_1_1x1_bn"
}
layer {
  name: "transition_down_1_1x1_conv"
  type: "Convolution"
  bottom: "transition_down_1_1x1_bn"
  top: "transition_down_1_1x1_conv"
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "transition_down_1_1x1_dropout"
  type: "Dropout"
  bottom: "transition_down_1_1x1_conv"
  top: "transition_down_1_1x1_dropout"
  dropout_param {
    dropout_ratio: 0.2
  }
}
layer {
  name: "transition_down_1_pooling"
  type: "Pooling"
  bottom: "transition_down_1_1x1_dropout"
  top: "transition_down_1_pooling"
  pooling_param {
    pool: AVE
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "block_2_1_1x1_bn"
  type: "BatchNorm"
  bottom: "transition_down_1_pooling"
  top: "block_2_1_1x1_bn"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "block_2_1_1x1_scale"
  type: "Scale"
  bottom: "block_2_1_1x1_bn"
  top: "block_2_1_1x1_bn"
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "block_2_1_1x1_relu"
  type: "PReLU"
  bottom: "block_2_1_1x1_bn"
  top: "block_2_1_1x1_bn"
}
layer {
  name: "block_2_1_1x1_conv"
  type: "Convolution"
  bottom: "block_2_1_1x1_bn"
  top: "block_2_1_1x1_conv"
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "block_2_1_1x1_dropout"
  type: "Dropout"
  bottom: "block_2_1_1x1_conv"
  top: "block_2_1_1x1_dropout"
  dropout_param {
    dropout_ratio: 0.2
  }
}
layer {
  name: "block_2_1_3x3_bn"
  type: "BatchNorm"
  bottom: "block_2_1_1x1_dropout"
  top: "block_2_1_3x3_bn"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "block_2_1_3x3_scale"
  type: "Scale"
  bottom: "block_2_1_3x3_bn"
  top: "block_2_1_3x3_bn"
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "block_2_1_3x3_relu"
  type: "PReLU"
  bottom: "block_2_1_3x3_bn"
  top: "block_2_1_3x3_bn"
}
layer {
  name: "block_2_1_3x3_conv"
  type: "Convolution"
  bottom: "block_2_1_3x3_bn"
  top: "block_2_1_3x3_conv"
  convolution_param {
    num_output: 32
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "block_2_1_3x3_dropout"
  type: "Dropout"
  bottom: "block_2_1_3x3_conv"
  top: "block_2_1_3x3_dropout"
  dropout_param {
    dropout_ratio: 0.2
  }
}
layer {
  name: "block_2_1_concat"
  type: "Concat"
  bottom: "transition_down_1_pooling"
  bottom: "block_2_1_3x3_dropout"
  top: "block_2_1_concat"
  concat_param {
    axis: 1
  }
}
layer {
  name: "block_2_2_1x1_bn"
  type: "BatchNorm"
  bottom: "block_2_1_concat"
  top: "block_2_2_1x1_bn"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "block_2_2_1x1_scale"
  type: "Scale"
  bottom: "block_2_2_1x1_bn"
  top: "block_2_2_1x1_bn"
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "block_2_2_1x1_relu"
  type: "PReLU"
  bottom: "block_2_2_1x1_bn"
  top: "block_2_2_1x1_bn"
}
layer {
  name: "block_2_2_1x1_conv"
  type: "Convolution"
  bottom: "block_2_2_1x1_bn"
  top: "block_2_2_1x1_conv"
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "block_2_2_1x1_dropout"
  type: "Dropout"
  bottom: "block_2_2_1x1_conv"
  top: "block_2_2_1x1_dropout"
  dropout_param {
    dropout_ratio: 0.2
  }
}
layer {
  name: "block_2_2_3x3_bn"
  type: "BatchNorm"
  bottom: "block_2_2_1x1_dropout"
  top: "block_2_2_3x3_bn"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "block_2_2_3x3_scale"
  type: "Scale"
  bottom: "block_2_2_3x3_bn"
  top: "block_2_2_3x3_bn"
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "block_2_2_3x3_relu"
  type: "PReLU"
  bottom: "block_2_2_3x3_bn"
  top: "block_2_2_3x3_bn"
}
layer {
  name: "block_2_2_3x3_conv"
  type: "Convolution"
  bottom: "block_2_2_3x3_bn"
  top: "block_2_2_3x3_conv"
  convolution_param {
    num_output: 32
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "block_2_2_3x3_dropout"
  type: "Dropout"
  bottom: "block_2_2_3x3_conv"
  top: "block_2_2_3x3_dropout"
  dropout_param {
    dropout_ratio: 0.2
  }
}
layer {
  name: "block_2_2_concat"
  type: "Concat"
  bottom: "block_2_1_concat"
  bottom: "block_2_2_3x3_dropout"
  top: "block_2_2_concat"
  concat_param {
    axis: 1
  }
}
layer {
  name: "block_2_3_1x1_bn"
  type: "BatchNorm"
  bottom: "block_2_2_concat"
  top: "block_2_3_1x1_bn"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "block_2_3_1x1_scale"
  type: "Scale"
  bottom: "block_2_3_1x1_bn"
  top: "block_2_3_1x1_bn"
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "block_2_3_1x1_relu"
  type: "PReLU"
  bottom: "block_2_3_1x1_bn"
  top: "block_2_3_1x1_bn"
}
layer {
  name: "block_2_3_1x1_conv"
  type: "Convolution"
  bottom: "block_2_3_1x1_bn"
  top: "block_2_3_1x1_conv"
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "block_2_3_1x1_dropout"
  type: "Dropout"
  bottom: "block_2_3_1x1_conv"
  top: "block_2_3_1x1_dropout"
  dropout_param {
    dropout_ratio: 0.2
  }
}
layer {
  name: "block_2_3_3x3_bn"
  type: "BatchNorm"
  bottom: "block_2_3_1x1_dropout"
  top: "block_2_3_3x3_bn"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "block_2_3_3x3_scale"
  type: "Scale"
  bottom: "block_2_3_3x3_bn"
  top: "block_2_3_3x3_bn"
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "block_2_3_3x3_relu"
  type: "PReLU"
  bottom: "block_2_3_3x3_bn"
  top: "block_2_3_3x3_bn"
}
layer {
  name: "block_2_3_3x3_conv"
  type: "Convolution"
  bottom: "block_2_3_3x3_bn"
  top: "block_2_3_3x3_conv"
  convolution_param {
    num_output: 32
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "block_2_3_3x3_dropout"
  type: "Dropout"
  bottom: "block_2_3_3x3_conv"
  top: "block_2_3_3x3_dropout"
  dropout_param {
    dropout_ratio: 0.2
  }
}
layer {
  name: "block_2_3_concat"
  type: "Concat"
  bottom: "block_2_2_concat"
  bottom: "block_2_3_3x3_dropout"
  top: "block_2_3_concat"
  concat_param {
    axis: 1
  }
}
layer {
  name: "block_2_4_1x1_bn"
  type: "BatchNorm"
  bottom: "block_2_3_concat"
  top: "block_2_4_1x1_bn"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "block_2_4_1x1_scale"
  type: "Scale"
  bottom: "block_2_4_1x1_bn"
  top: "block_2_4_1x1_bn"
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "block_2_4_1x1_relu"
  type: "PReLU"
  bottom: "block_2_4_1x1_bn"
  top: "block_2_4_1x1_bn"
}
layer {
  name: "block_2_4_1x1_conv"
  type: "Convolution"
  bottom: "block_2_4_1x1_bn"
  top: "block_2_4_1x1_conv"
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "block_2_4_1x1_dropout"
  type: "Dropout"
  bottom: "block_2_4_1x1_conv"
  top: "block_2_4_1x1_dropout"
  dropout_param {
    dropout_ratio: 0.2
  }
}
layer {
  name: "block_2_4_3x3_bn"
  type: "BatchNorm"
  bottom: "block_2_4_1x1_dropout"
  top: "block_2_4_3x3_bn"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "block_2_4_3x3_scale"
  type: "Scale"
  bottom: "block_2_4_3x3_bn"
  top: "block_2_4_3x3_bn"
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "block_2_4_3x3_relu"
  type: "PReLU"
  bottom: "block_2_4_3x3_bn"
  top: "block_2_4_3x3_bn"
}
layer {
  name: "block_2_4_3x3_conv"
  type: "Convolution"
  bottom: "block_2_4_3x3_bn"
  top: "block_2_4_3x3_conv"
  convolution_param {
    num_output: 32
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "block_2_4_3x3_dropout"
  type: "Dropout"
  bottom: "block_2_4_3x3_conv"
  top: "block_2_4_3x3_dropout"
  dropout_param {
    dropout_ratio: 0.2
  }
}
layer {
  name: "block_2_4_concat"
  type: "Concat"
  bottom: "block_2_3_concat"
  bottom: "block_2_4_3x3_dropout"
  top: "block_2_4_concat"
  concat_param {
    axis: 1
  }
}
layer {
  name: "block_2_5_1x1_bn"
  type: "BatchNorm"
  bottom: "block_2_4_concat"
  top: "block_2_5_1x1_bn"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "block_2_5_1x1_scale"
  type: "Scale"
  bottom: "block_2_5_1x1_bn"
  top: "block_2_5_1x1_bn"
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "block_2_5_1x1_relu"
  type: "PReLU"
  bottom: "block_2_5_1x1_bn"
  top: "block_2_5_1x1_bn"
}
layer {
  name: "block_2_5_1x1_conv"
  type: "Convolution"
  bottom: "block_2_5_1x1_bn"
  top: "block_2_5_1x1_conv"
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "block_2_5_1x1_dropout"
  type: "Dropout"
  bottom: "block_2_5_1x1_conv"
  top: "block_2_5_1x1_dropout"
  dropout_param {
    dropout_ratio: 0.2
  }
}
layer {
  name: "block_2_5_3x3_bn"
  type: "BatchNorm"
  bottom: "block_2_5_1x1_dropout"
  top: "block_2_5_3x3_bn"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "block_2_5_3x3_scale"
  type: "Scale"
  bottom: "block_2_5_3x3_bn"
  top: "block_2_5_3x3_bn"
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "block_2_5_3x3_relu"
  type: "PReLU"
  bottom: "block_2_5_3x3_bn"
  top: "block_2_5_3x3_bn"
}
layer {
  name: "block_2_5_3x3_conv"
  type: "Convolution"
  bottom: "block_2_5_3x3_bn"
  top: "block_2_5_3x3_conv"
  convolution_param {
    num_output: 32
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "block_2_5_3x3_dropout"
  type: "Dropout"
  bottom: "block_2_5_3x3_conv"
  top: "block_2_5_3x3_dropout"
  dropout_param {
    dropout_ratio: 0.2
  }
}
layer {
  name: "block_2_5_concat"
  type: "Concat"
  bottom: "block_2_4_concat"
  bottom: "block_2_5_3x3_dropout"
  top: "block_2_5_concat"
  concat_param {
    axis: 1
  }
}
layer {
  name: "block_2_6_1x1_bn"
  type: "BatchNorm"
  bottom: "block_2_5_concat"
  top: "block_2_6_1x1_bn"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "block_2_6_1x1_scale"
  type: "Scale"
  bottom: "block_2_6_1x1_bn"
  top: "block_2_6_1x1_bn"
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "block_2_6_1x1_relu"
  type: "PReLU"
  bottom: "block_2_6_1x1_bn"
  top: "block_2_6_1x1_bn"
}
layer {
  name: "block_2_6_1x1_conv"
  type: "Convolution"
  bottom: "block_2_6_1x1_bn"
  top: "block_2_6_1x1_conv"
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "block_2_6_1x1_dropout"
  type: "Dropout"
  bottom: "block_2_6_1x1_conv"
  top: "block_2_6_1x1_dropout"
  dropout_param {
    dropout_ratio: 0.2
  }
}
layer {
  name: "block_2_6_3x3_bn"
  type: "BatchNorm"
  bottom: "block_2_6_1x1_dropout"
  top: "block_2_6_3x3_bn"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "block_2_6_3x3_scale"
  type: "Scale"
  bottom: "block_2_6_3x3_bn"
  top: "block_2_6_3x3_bn"
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "block_2_6_3x3_relu"
  type: "PReLU"
  bottom: "block_2_6_3x3_bn"
  top: "block_2_6_3x3_bn"
}
layer {
  name: "block_2_6_3x3_conv"
  type: "Convolution"
  bottom: "block_2_6_3x3_bn"
  top: "block_2_6_3x3_conv"
  convolution_param {
    num_output: 32
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "block_2_6_3x3_dropout"
  type: "Dropout"
  bottom: "block_2_6_3x3_conv"
  top: "block_2_6_3x3_dropout"
  dropout_param {
    dropout_ratio: 0.2
  }
}
layer {
  name: "block_2_6_concat"
  type: "Concat"
  bottom: "block_2_5_concat"
  bottom: "block_2_6_3x3_dropout"
  top: "block_2_6_concat"
  concat_param {
    axis: 1
  }
}
layer {
  name: "block_2_7_1x1_bn"
  type: "BatchNorm"
  bottom: "block_2_6_concat"
  top: "block_2_7_1x1_bn"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "block_2_7_1x1_scale"
  type: "Scale"
  bottom: "block_2_7_1x1_bn"
  top: "block_2_7_1x1_bn"
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "block_2_7_1x1_relu"
  type: "PReLU"
  bottom: "block_2_7_1x1_bn"
  top: "block_2_7_1x1_bn"
}
layer {
  name: "block_2_7_1x1_conv"
  type: "Convolution"
  bottom: "block_2_7_1x1_bn"
  top: "block_2_7_1x1_conv"
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "block_2_7_1x1_dropout"
  type: "Dropout"
  bottom: "block_2_7_1x1_conv"
  top: "block_2_7_1x1_dropout"
  dropout_param {
    dropout_ratio: 0.2
  }
}
layer {
  name: "block_2_7_3x3_bn"
  type: "BatchNorm"
  bottom: "block_2_7_1x1_dropout"
  top: "block_2_7_3x3_bn"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "block_2_7_3x3_scale"
  type: "Scale"
  bottom: "block_2_7_3x3_bn"
  top: "block_2_7_3x3_bn"
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "block_2_7_3x3_relu"
  type: "PReLU"
  bottom: "block_2_7_3x3_bn"
  top: "block_2_7_3x3_bn"
}
layer {
  name: "block_2_7_3x3_conv"
  type: "Convolution"
  bottom: "block_2_7_3x3_bn"
  top: "block_2_7_3x3_conv"
  convolution_param {
    num_output: 32
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "block_2_7_3x3_dropout"
  type: "Dropout"
  bottom: "block_2_7_3x3_conv"
  top: "block_2_7_3x3_dropout"
  dropout_param {
    dropout_ratio: 0.2
  }
}
layer {
  name: "block_2_7_concat"
  type: "Concat"
  bottom: "block_2_6_concat"
  bottom: "block_2_7_3x3_dropout"
  top: "block_2_7_concat"
  concat_param {
    axis: 1
  }
}
layer {
  name: "block_2_8_1x1_bn"
  type: "BatchNorm"
  bottom: "block_2_7_concat"
  top: "block_2_8_1x1_bn"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "block_2_8_1x1_scale"
  type: "Scale"
  bottom: "block_2_8_1x1_bn"
  top: "block_2_8_1x1_bn"
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "block_2_8_1x1_relu"
  type: "PReLU"
  bottom: "block_2_8_1x1_bn"
  top: "block_2_8_1x1_bn"
}
layer {
  name: "block_2_8_1x1_conv"
  type: "Convolution"
  bottom: "block_2_8_1x1_bn"
  top: "block_2_8_1x1_conv"
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "block_2_8_1x1_dropout"
  type: "Dropout"
  bottom: "block_2_8_1x1_conv"
  top: "block_2_8_1x1_dropout"
  dropout_param {
    dropout_ratio: 0.2
  }
}
layer {
  name: "block_2_8_3x3_bn"
  type: "BatchNorm"
  bottom: "block_2_8_1x1_dropout"
  top: "block_2_8_3x3_bn"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "block_2_8_3x3_scale"
  type: "Scale"
  bottom: "block_2_8_3x3_bn"
  top: "block_2_8_3x3_bn"
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "block_2_8_3x3_relu"
  type: "PReLU"
  bottom: "block_2_8_3x3_bn"
  top: "block_2_8_3x3_bn"
}
layer {
  name: "block_2_8_3x3_conv"
  type: "Convolution"
  bottom: "block_2_8_3x3_bn"
  top: "block_2_8_3x3_conv"
  convolution_param {
    num_output: 32
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "block_2_8_3x3_dropout"
  type: "Dropout"
  bottom: "block_2_8_3x3_conv"
  top: "block_2_8_3x3_dropout"
  dropout_param {
    dropout_ratio: 0.2
  }
}
layer {
  name: "block_2_8_concat"
  type: "Concat"
  bottom: "block_2_7_concat"
  bottom: "block_2_8_3x3_dropout"
  top: "block_2_8_concat"
  concat_param {
    axis: 1
  }
}
layer {
  name: "block_2_9_1x1_bn"
  type: "BatchNorm"
  bottom: "block_2_8_concat"
  top: "block_2_9_1x1_bn"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "block_2_9_1x1_scale"
  type: "Scale"
  bottom: "block_2_9_1x1_bn"
  top: "block_2_9_1x1_bn"
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "block_2_9_1x1_relu"
  type: "PReLU"
  bottom: "block_2_9_1x1_bn"
  top: "block_2_9_1x1_bn"
}
layer {
  name: "block_2_9_1x1_conv"
  type: "Convolution"
  bottom: "block_2_9_1x1_bn"
  top: "block_2_9_1x1_conv"
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "block_2_9_1x1_dropout"
  type: "Dropout"
  bottom: "block_2_9_1x1_conv"
  top: "block_2_9_1x1_dropout"
  dropout_param {
    dropout_ratio: 0.2
  }
}
layer {
  name: "block_2_9_3x3_bn"
  type: "BatchNorm"
  bottom: "block_2_9_1x1_dropout"
  top: "block_2_9_3x3_bn"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "block_2_9_3x3_scale"
  type: "Scale"
  bottom: "block_2_9_3x3_bn"
  top: "block_2_9_3x3_bn"
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "block_2_9_3x3_relu"
  type: "PReLU"
  bottom: "block_2_9_3x3_bn"
  top: "block_2_9_3x3_bn"
}
layer {
  name: "block_2_9_3x3_conv"
  type: "Convolution"
  bottom: "block_2_9_3x3_bn"
  top: "block_2_9_3x3_conv"
  convolution_param {
    num_output: 32
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "block_2_9_3x3_dropout"
  type: "Dropout"
  bottom: "block_2_9_3x3_conv"
  top: "block_2_9_3x3_dropout"
  dropout_param {
    dropout_ratio: 0.2
  }
}
layer {
  name: "block_2_9_concat"
  type: "Concat"
  bottom: "block_2_8_concat"
  bottom: "block_2_9_3x3_dropout"
  top: "block_2_9_concat"
  concat_param {
    axis: 1
  }
}
layer {
  name: "block_2_10_1x1_bn"
  type: "BatchNorm"
  bottom: "block_2_9_concat"
  top: "block_2_10_1x1_bn"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "block_2_10_1x1_scale"
  type: "Scale"
  bottom: "block_2_10_1x1_bn"
  top: "block_2_10_1x1_bn"
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "block_2_10_1x1_relu"
  type: "PReLU"
  bottom: "block_2_10_1x1_bn"
  top: "block_2_10_1x1_bn"
}
layer {
  name: "block_2_10_1x1_conv"
  type: "Convolution"
  bottom: "block_2_10_1x1_bn"
  top: "block_2_10_1x1_conv"
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "block_2_10_1x1_dropout"
  type: "Dropout"
  bottom: "block_2_10_1x1_conv"
  top: "block_2_10_1x1_dropout"
  dropout_param {
    dropout_ratio: 0.2
  }
}
layer {
  name: "block_2_10_3x3_bn"
  type: "BatchNorm"
  bottom: "block_2_10_1x1_dropout"
  top: "block_2_10_3x3_bn"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "block_2_10_3x3_scale"
  type: "Scale"
  bottom: "block_2_10_3x3_bn"
  top: "block_2_10_3x3_bn"
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "block_2_10_3x3_relu"
  type: "PReLU"
  bottom: "block_2_10_3x3_bn"
  top: "block_2_10_3x3_bn"
}
layer {
  name: "block_2_10_3x3_conv"
  type: "Convolution"
  bottom: "block_2_10_3x3_bn"
  top: "block_2_10_3x3_conv"
  convolution_param {
    num_output: 32
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "block_2_10_3x3_dropout"
  type: "Dropout"
  bottom: "block_2_10_3x3_conv"
  top: "block_2_10_3x3_dropout"
  dropout_param {
    dropout_ratio: 0.2
  }
}
layer {
  name: "block_2_10_concat"
  type: "Concat"
  bottom: "block_2_9_concat"
  bottom: "block_2_10_3x3_dropout"
  top: "block_2_10_concat"
  concat_param {
    axis: 1
  }
}
layer {
  name: "block_2_11_1x1_bn"
  type: "BatchNorm"
  bottom: "block_2_10_concat"
  top: "block_2_11_1x1_bn"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "block_2_11_1x1_scale"
  type: "Scale"
  bottom: "block_2_11_1x1_bn"
  top: "block_2_11_1x1_bn"
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "block_2_11_1x1_relu"
  type: "PReLU"
  bottom: "block_2_11_1x1_bn"
  top: "block_2_11_1x1_bn"
}
layer {
  name: "block_2_11_1x1_conv"
  type: "Convolution"
  bottom: "block_2_11_1x1_bn"
  top: "block_2_11_1x1_conv"
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "block_2_11_1x1_dropout"
  type: "Dropout"
  bottom: "block_2_11_1x1_conv"
  top: "block_2_11_1x1_dropout"
  dropout_param {
    dropout_ratio: 0.2
  }
}
layer {
  name: "block_2_11_3x3_bn"
  type: "BatchNorm"
  bottom: "block_2_11_1x1_dropout"
  top: "block_2_11_3x3_bn"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "block_2_11_3x3_scale"
  type: "Scale"
  bottom: "block_2_11_3x3_bn"
  top: "block_2_11_3x3_bn"
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "block_2_11_3x3_relu"
  type: "PReLU"
  bottom: "block_2_11_3x3_bn"
  top: "block_2_11_3x3_bn"
}
layer {
  name: "block_2_11_3x3_conv"
  type: "Convolution"
  bottom: "block_2_11_3x3_bn"
  top: "block_2_11_3x3_conv"
  convolution_param {
    num_output: 32
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "block_2_11_3x3_dropout"
  type: "Dropout"
  bottom: "block_2_11_3x3_conv"
  top: "block_2_11_3x3_dropout"
  dropout_param {
    dropout_ratio: 0.2
  }
}
layer {
  name: "block_2_11_concat"
  type: "Concat"
  bottom: "block_2_10_concat"
  bottom: "block_2_11_3x3_dropout"
  top: "block_2_11_concat"
  concat_param {
    axis: 1
  }
}
layer {
  name: "block_2_12_1x1_bn"
  type: "BatchNorm"
  bottom: "block_2_11_concat"
  top: "block_2_12_1x1_bn"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "block_2_12_1x1_scale"
  type: "Scale"
  bottom: "block_2_12_1x1_bn"
  top: "block_2_12_1x1_bn"
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "block_2_12_1x1_relu"
  type: "PReLU"
  bottom: "block_2_12_1x1_bn"
  top: "block_2_12_1x1_bn"
}
layer {
  name: "block_2_12_1x1_conv"
  type: "Convolution"
  bottom: "block_2_12_1x1_bn"
  top: "block_2_12_1x1_conv"
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "block_2_12_1x1_dropout"
  type: "Dropout"
  bottom: "block_2_12_1x1_conv"
  top: "block_2_12_1x1_dropout"
  dropout_param {
    dropout_ratio: 0.2
  }
}
layer {
  name: "block_2_12_3x3_bn"
  type: "BatchNorm"
  bottom: "block_2_12_1x1_dropout"
  top: "block_2_12_3x3_bn"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "block_2_12_3x3_scale"
  type: "Scale"
  bottom: "block_2_12_3x3_bn"
  top: "block_2_12_3x3_bn"
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "block_2_12_3x3_relu"
  type: "PReLU"
  bottom: "block_2_12_3x3_bn"
  top: "block_2_12_3x3_bn"
}
layer {
  name: "block_2_12_3x3_conv"
  type: "Convolution"
  bottom: "block_2_12_3x3_bn"
  top: "block_2_12_3x3_conv"
  convolution_param {
    num_output: 32
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "block_2_12_3x3_dropout"
  type: "Dropout"
  bottom: "block_2_12_3x3_conv"
  top: "block_2_12_3x3_dropout"
  dropout_param {
    dropout_ratio: 0.2
  }
}
layer {
  name: "block_2_12_concat"
  type: "Concat"
  bottom: "block_2_11_concat"
  bottom: "block_2_12_3x3_dropout"
  top: "block_2_12_concat"
  concat_param {
    axis: 1
  }
}
layer {
  name: "transition_down_2_1x1_bn"
  type: "BatchNorm"
  bottom: "block_2_12_concat"
  top: "transition_down_2_1x1_bn"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "transition_down_2_1x1_scale"
  type: "Scale"
  bottom: "transition_down_2_1x1_bn"
  top: "transition_down_2_1x1_bn"
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "transition_down_2_1x1_relu"
  type: "PReLU"
  bottom: "transition_down_2_1x1_bn"
  top: "transition_down_2_1x1_bn"
}
layer {
  name: "transition_down_2_1x1_conv"
  type: "Convolution"
  bottom: "transition_down_2_1x1_bn"
  top: "transition_down_2_1x1_conv"
  convolution_param {
    num_output: 256
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "transition_down_2_1x1_dropout"
  type: "Dropout"
  bottom: "transition_down_2_1x1_conv"
  top: "transition_down_2_1x1_dropout"
  dropout_param {
    dropout_ratio: 0.2
  }
}
layer {
  name: "transition_down_2_pooling"
  type: "Pooling"
  bottom: "transition_down_2_1x1_dropout"
  top: "transition_down_2_pooling"
  pooling_param {
    pool: AVE
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "block_3_1_1x1_bn"
  type: "BatchNorm"
  bottom: "transition_down_2_pooling"
  top: "block_3_1_1x1_bn"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "block_3_1_1x1_scale"
  type: "Scale"
  bottom: "block_3_1_1x1_bn"
  top: "block_3_1_1x1_bn"
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "block_3_1_1x1_relu"
  type: "PReLU"
  bottom: "block_3_1_1x1_bn"
  top: "block_3_1_1x1_bn"
}
layer {
  name: "block_3_1_1x1_conv"
  type: "Convolution"
  bottom: "block_3_1_1x1_bn"
  top: "block_3_1_1x1_conv"
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "block_3_1_1x1_dropout"
  type: "Dropout"
  bottom: "block_3_1_1x1_conv"
  top: "block_3_1_1x1_dropout"
  dropout_param {
    dropout_ratio: 0.2
  }
}
layer {
  name: "block_3_1_3x3_bn"
  type: "BatchNorm"
  bottom: "block_3_1_1x1_dropout"
  top: "block_3_1_3x3_bn"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "block_3_1_3x3_scale"
  type: "Scale"
  bottom: "block_3_1_3x3_bn"
  top: "block_3_1_3x3_bn"
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "block_3_1_3x3_relu"
  type: "PReLU"
  bottom: "block_3_1_3x3_bn"
  top: "block_3_1_3x3_bn"
}
layer {
  name: "block_3_1_3x3_conv"
  type: "Convolution"
  bottom: "block_3_1_3x3_bn"
  top: "block_3_1_3x3_conv"
  convolution_param {
    num_output: 32
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "block_3_1_3x3_dropout"
  type: "Dropout"
  bottom: "block_3_1_3x3_conv"
  top: "block_3_1_3x3_dropout"
  dropout_param {
    dropout_ratio: 0.2
  }
}
layer {
  name: "block_3_1_concat"
  type: "Concat"
  bottom: "transition_down_2_pooling"
  bottom: "block_3_1_3x3_dropout"
  top: "block_3_1_concat"
  concat_param {
    axis: 1
  }
}
layer {
  name: "block_3_2_1x1_bn"
  type: "BatchNorm"
  bottom: "block_3_1_concat"
  top: "block_3_2_1x1_bn"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "block_3_2_1x1_scale"
  type: "Scale"
  bottom: "block_3_2_1x1_bn"
  top: "block_3_2_1x1_bn"
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "block_3_2_1x1_relu"
  type: "PReLU"
  bottom: "block_3_2_1x1_bn"
  top: "block_3_2_1x1_bn"
}
layer {
  name: "block_3_2_1x1_conv"
  type: "Convolution"
  bottom: "block_3_2_1x1_bn"
  top: "block_3_2_1x1_conv"
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
  }
}
layer {
  name: "block_3_2_1x1_dropout"
  type: "Dropout"
  bottom: "block_3_2_1x1_conv"
  top: "block_3_2_1x1_dropout"
  dropout_param {
    dropout_ratio: 0.2
  }
}
layer {
  name: "block_3_2_3x3_bn"
  type: "BatchNorm"
  bottom: "block_3_2_1x1_dropout"
  top: "block_3_2_3x3_bn"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  batch_norm_param {
    use_global_stats: false
  }
}
layer {
  name: "block_3_2_3x3_scale"
  type: "Scale"
  bottom: "block_3_2_3x3_bn"
  top: "block_3_2_3x3_bn"
  scale_param {
    filler {
      value: 1
    }
    bias_term: true
    bias_filler {
      value: 0
    }
  }
}
layer {
  name: "block_3_2_3x3_relu"
  type: "PReLU"
